Revit 2027 API
RebarShape.ShapeFamilyId Property
 Get and return the rebar shape family id.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ShapeFamilyId { get; }
Public ReadOnly Property ShapeFamilyId As ElementId
	Get
public:
property ElementId^ ShapeFamilyId {
	ElementId^ get ();
}
member ShapeFamilyId : ElementId with get
Property Value
ElementId
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace